In [6]:
import pandas as pd

In [9]:
data = {
    "class": ["A", "A", "B", "B"],
    "name": ["철수", "영희", "민수", "지수"],
    "score": [80, 90, 70, 85]
}

df = pd.DataFrame(data)
df

  class name  score
0     A   철수     80
1     A   영희     90
2     B   민수     70
3     B   지수     85

In [12]:
df.groupby('class')

for key,value in df.groupby('class'):
    print(key)
    print(value)

A
  class name  score
0     A   철수     80
1     A   영희     90
B
  class name  score
2     B   민수     70
3     B   지수     85

In [16]:
print(df.groupby('class')['score'].mean())

class
A    85.0
B    77.5
Name: score, dtype: float64

In [19]:
data1 = {
    '학급': ['A', 'A', 'B', 'B', 'C', 'C'],
    '이름': ['철수', '영희', '민수', '수진', '지훈', '혜진'],
    '수학': [90, 80, 70, 85, 60, 95],
    '영어': [85, 88, 75, 70, 95, 90]
}

df1 = pd.DataFrame(data1)
df1

  학급  이름  수학  영어
0  A  철수  90  85
1  A  영희  80  88
2  B  민수  70  75
3  B  수진  85  70
4  C  지훈  60  95
5  C  혜진  95  90

In [30]:
df1_mean = df1.groupby('학급')[['수학', '영어']].mean().reset_index()
df1_mean

  학급    수학    영어
0  A  85.0  86.5
1  B  77.5  72.5
2  C  77.5  92.5

In [37]:
df2_mean = df1.groupby('학급')[['수학','영어']].mean().reset_index()
print(df2_mean)
print(df2_mean.shape)

  학급    수학    영어
0  A  85.0  86.5
1  B  77.5  72.5
2  C  77.5  92.5
(3, 3)

In [39]:
df1.groupby('학급')['수학'].agg(['mean','max','count'])

    mean  max  count
학급
A   85.0   90      2
B   77.5   85      2
C   77.5   95      2

In [40]:
df1['수학'].mean()

np.float64(80.0)

In [43]:
df1.groupby('학급')['수학'].describe()

    count  mean        std   min    25%   50%    75%   max
학급
A     2.0  85.0   7.071068  80.0  82.50  85.0  87.50  90.0
B     2.0  77.5  10.606602  70.0  73.75  77.5  81.25  85.0
C     2.0  77.5  24.748737  60.0  68.75  77.5  86.25  95.0

In [48]:
df1.groupby('학급')['수학'].agg(
    평균='mean',
    최고='max'
)

      평균  최고
학급
A   85.0  90
B   77.5  85
C   77.5  95

In [50]:

df1.groupby('학급').agg(
    수학평균=('수학', 'mean'),
    영어평균=('영어', 'mean')
)

    수학평균  영어평균
학급
A   85.0  86.5
B   77.5  72.5
C   77.5  92.5

In [52]:
tdf = pd.read_csv("data/titanic.csv")
tdf

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [54]:
tdf.sort_values(by='pclass',ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
853,1,1,female,16.0,0,1,39.4000,S,First,woman,False,D,Southampton,yes,False
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
31,1,1,female,NaN,1,0,146.5208,C,First,woman,False,B,Cherbourg,yes,False

In [57]:
tdf[['age','fare']].mean()
tdf[['age','fare']].sum()

age     21205.1700
fare    28693.9493
dtype: float64

In [60]:
tdf[['age','survived','fare']].describe().round(2)

          age  survived    fare
count  714.00    891.00  891.00
mean    29.70      0.38   32.20
std     14.53      0.49   49.69
min      0.42      0.00    0.00
25%     20.12      0.00    7.91
50%     28.00      0.00   14.45
75%     38.00      1.00   31.00
max     80.00      1.00  512.33

In [62]:
tg = tdf.groupby('pclass')

In [64]:
tg[['age','survived','fare']].count()

        age  survived  fare
pclass
1       186       216   216
2       173       184   184
3       355       491   491

In [66]:
tg.count()

,survived,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
pclass,,,,,,,,,,,,,,
1,216,216,186,216,216,216,214,216,216,216,175,214,216,216
2,184,184,173,184,184,184,184,184,184,184,16,184,184,184
3,491,491,355,491,491,491,491,491,491,491,12,491,491,491

In [69]:
tg['survived'].agg(['count','sum'])

        count  sum
pclass
1         216  136
2         184   87
3         491  119